from .library import *
from .Information import *
from .updater import *

async def help_1(event):
        panel = f'''
        از دستورات زیر استفاده کنید:
        \n`timename` on|off : زمان در اسم روشن|خاموش
        \n`mini` on : فونت مینی روشن
        \n`bio` on|off : بیو روشن|خاموش
        \n`default` on : فونت عادی
        \n`bold` on : فونت بولد
        \n`mono` on : فونت یه مدلی
        \n`heart` on|off : حالت قلب روشن|خاموش 
        \n`rname` on|off :  اسم تصادفی روشن|خاموش
        \n`see rname` : دیدن اسم های تصادفی
        \n`see bio` : دیدن بیو
        \n`/addbio` (time,DATE,heart) [text]: این دستور برای اضافه کردن یک بیوگرافی یا توضیح کوتاه به پروفایل شما می‌تواند استفاده شود، که می‌تواند به دیگران در یادگیری بیشتر درباره شما کمک کند.
        \n`/addlname` (time,heart) [text]: متن تنظیمی برای تایم نیم است و دارای متغییر است که time زمان و heart قلب رندوم قرار میدهد
        \n`/addrname` [name1,name2,...]: برای تنظیم نام رندوم است
        \n`/delrname`: برای حذف نام رندوم است
        \n`see lname` : دیدن متن لست نیم
        \n`/ping` - زمان پاسخ دهی ربات را دریافت کنید.
        \n`/mem` - مصرف حافظه فعلی ربات را دریافت کنید.
        \n`/gmusic` [query] - در SoundCloud برای پیدا کردن یک قطعه موسیقی و دانلود آن جستجو کنید.
        \n`/tarikh` - تاریخ شمسی (ایرانی) فعلی را دریافت کنید.
        \n`/gmsg` [message] - یک پیام را با نمایش هر حرف به تدریج نمایش دهید.
        \n`/weather` [city] - اطلاعات آب و هوای فعلی شهر مورد نظر را دریافت کنید.
        \n/info [@username] - اطلاعاتی درباره کاربری را که آن را مشخص می کنید دریافت کنید.
        \n`/setprof` - عکس پروفایل ربات را (با پاسخ به تصویر) تنظیم کنید.
        \n`/rinfo` - با پاسخ دادن به یکی از پیام های کاربر، اطلاعات درباره کاربر را دریافت کنید.
        '''
        await event.edit(panel)

async def help_2(event):
        panel = f'''
        از دستورات زیر استفاده کنید:
        \n`/backupchat`: این دستور می‌تواند برای پشتیبان گیری از تمام تاریخچه گفتگو، از جمله پیام‌ها، تصاویر و سایر محتواها استفاده شود، که می‌تواند برای اهداف بایگانی یا در صورت از دست دادن داده‌ها مفید باشد.
        \n`/create_channel`: این دستور برای ایجاد یک کانال یا چت گروهی جدید در داخل پلتفرم پیام رسانی مورد استفاده قرار می‌گیرد، که می‌تواند برای سازماندهی گفتگوها در مورد موضوعات خاص یا با گروه‌های خاص از افراد مفید باشد.
        \n`/calc`: این دستور برای انجام محاسبات ساده مانند جمع، تفریق، ضرب و تقسیم مستقیماً در رابط گفتگو استفاده می‌شود.
        \n`/silent`:این دستور اگر روی کاربری ریپلی شود کاربر را در لیست سکوت قرار میدهد و اگر در زمان سکوت بیشتر از 5 پیام ارسال کند کاربر را بلاک میکند.
        \n`/unsilent`:برای در اوردن کاربر از حالت /silent.
        \n`/tag`: این دستور برای تگ کردن تمامی افراد گروه میباشد.
        \n`/Del`:اگر روی پیامی ریپلای شود اون پیام را پاک میکند.
        \n`/GSilent`:برای سکوت کردن کاربر در گروه میباشد.
        \n`/GUnSilent`: در اوردن کاربر از حالت سکوت گروه.
        \n`/promote`:ادمین کردن کاربر برای انجام دستورات گروهی.
        \n`/demote`: برای عزل کردن کاربر از حالت ادمین
        \n`/Gmedia`:اگر روی یک ویدیو ریپلی شود ان را در حافظه سلف ذخیره و هر جایی که بخواهید میتوانید ان را ارسال کنید.
        '''
        await event.edit(panel)

async def help_3(event):
        panel = f'''
        از دستورات زیر استفاده کنید:
        \n`/Smedia` [Name]:ارسال ویدیو سیو شده در حافظه سلف.
        \n`/Lmedia`:مشاهده ویدیو یا عکس های ذخیره شده در حافظه سلف.
        \n`/Freplay` [add] or [remove]:برای تنظیم کلمه برای پاسخ سریع توسط سلف .
        \n`/Lreplay`: مشاهده لیست کلمات ریپلای سریع.
        \n`/whois` [domain Name]:برای دریافت اطلاعات دامنه.
        \n`/Scrypto`: دریافت قیمت ارز های دیجیتال.
        \n`/sreplace` [key1],[key2]:اگر بر روی متنی ریپلی شود مقدار key1 را با مقدار key2 در متن عوض میکند
        \n`/Convertdate` [miladi date]:تبدیل تاریخ میلادی به شمسی.
        \n`/randnum` [num1]-[num2]:ارسال عدد رندوم بین num1 و num2 .
        \n`/setname` [name]:اسم شما را عوض میکند.
        \n`/sfootball`:نشان دادن وضعیت تیم ها در Bundesliga.
        \n`/setcolor` [green,pink,blue,red,yellow,purple,orange]:رنگ عکس ریپلای شده را به رنگ جلوی دستور تغییر میدهد.
        \n`/flood` [number] - [text1,text2,...]:به صورت رندوم به تعداد مشخص شده از بین کلمات تعیین شده پیام میفرستد.
        \n`/orcen` [ENtext] : متن را تبدیل به ویس میکند و میفرستد.
        \n`/setfname` [name] : اگر روی یک موزیک ریپلای شود نام اون رو به نام جلوی دستور تغییر میدهد
        \n`/screen` [domain] : از سایت مورد نظر اسکریین شات میگیرد.
        \n`/yt` [YT Video Link] : ویدیو یوتیوب مورد نظر را دانلود میکند و میفرستد .
        \n`/Sproxy`:دریافت پروکسی رایگان.
        \n`/Sv2ray`:دریافت سرور v2ray رایگان.
        '''
        await event.edit(panel)

async def help_4(event):
        panel = f'''
        از دستورات زیر استفاده کنید:
        \n`/time` [capital of country]: با قرار دادن پایتخت یک کشور زمان آن را به شما نشان می دهد
        \n`newtimer` [name]: یک تایمر با نام دلخواه برای شما ایجاد میکند
        \n`deltimer` [name]: تایمر مورد نظر را پاک می کند
        \n`timers` : تایمر ها را نمایش میدهد
        \n`clean timers` : تایمر ها را پاک میکند
        \n`gfile` [link] : با قرار دادن لینک جلو دستور آن را دانلود میکند
        \n`getip` [ip] : اطلاعات ip را میدهد
        \n`/sunextract`یا `/استخراج فایل` : اگر روی یک فایل زیپ ریپلای شود آن را اکسترکت میکند
        \n`Stv` : لینک پخش آنلاین تلویزیون
        \n`sqr` یا `به qr` : تبدیل به qrcode
        \n`readqr` یا `خواندن qr` : qrcode میخونه
        \n`cleanall` یا `پاکسازی همه` [txt] : پیام مورد نظر را در گروه پاک میکند 
        \n`setusername` [txt] : نام کاربری تنظیم میکند
        \n`kick` [usernames] or [numerical user IDs] : یوزر مورد نظر از گروه کیک میکنه
        \n`cleanb` [link 1] [link 2] : پیام های بین دو لینک پاک میکنه
        \n`/rem` [num] - حذف پیام‌های اخیر در گروه تا تعداد مشخص شده.
        \n`/sgoogle` [query] - جستجوی کوتاهی در گوگل برای پیدا کردن پاسخ به سوال شما.
        \n`/wiki` [query] - جستجوی کوتاهی در ویکی‌پدیای فارسی برای پیدا کردن پاسخ به سوال شما.
        \n`/save`: این دستور می‌تواند برای ذخیره یک گفتگو یا لاگ چت به یک فایل استفاده شود، که می‌تواند برای نگهداری یک رکورد از بحث‌های مهم یا به اشتراک گذاری با دیگران مفید باشد.
        \n`/reload`: این دستور برای بازنشانی رابط گفتگو یا کد ربات استفاده می‌شود، که می‌تواند در صورت وجود هرگونه خطا یا خللی که باید حل شود مفید باشد.
        '''
        await event.edit(panel)
